a = 1
b = "str"
#配列リテラル
c = [a,b,3, "文字列"] #=>[1,"str",3,"文字列"]
#ネストもできる
d = [a,c,[1,2,3]] #=>[1,[1,"str",3,"文字列"],[1,2,3]]

p c[-1]
p c[-2]
p c[-5]

p c[1,2]
p c[1,3]
p c[1,4]
p c[-2,2]
p c[4,2]
p "---------------------------"
p c[0..1]
p c[0...1]
p c[-2...-1]
p c[-2..3]
p c [-2...3]
p c[4..5]

a = [1,2]
a[0] = 3 #=> 3,2
a[4] = "4" #=> [3,2,nil,nil,"4"]
a[0,3] = "a","b","c" #=>["a", "b", "c", nil, "4"]
a[1..2] = 1,2 #=> ["a", 1, 2, nil, "4"]
a[0,2]= "?" #=> ["?", 2, nil, "4"]
a[0..2]= "A" #=> ["A", "4"]
a[-1] = "Z" #=> ["A", "Z"]

array1 =[1,2,"str"]
array2 =[1,2,"str"]
array1 == array2
array1 == ["str",1,2]
array1 == [1,2,"str","extra"]

if array1 == array2
  puts "array1 == array2"
else
  puts "array1 != array2"
end

